In [8]:
import pandas as pd
import numpy as np

In [16]:
df = pd.read_csv('air_quality.csv')
df.head()

,state_code,state_name,county_code,county_name,aqi,state_code_int,county_code_int
0,4,Arizona,13,Maricopa,18.0,4,13
1,4,Arizona,13,Maricopa,9.0,4,13
2,4,Arizona,19,Pima,20.0,4,19
3,6,California,1,Alameda,11.0,6,1
4,6,California,7,Butte,6.0,6,7

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1725 entries, 0 to 1724
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   state_code       1725 non-null   int64
 1   state_name       1725 non-null   object
 2   county_code      1725 non-null   int64
 3   county_name      1725 non-null   object
 4   aqi              1725 non-null   float64
 5   state_code_int   1725 non-null   int64
 6   county_code_int  1725 non-null   int64
dtypes: float64(1), int64(4), object(2)
memory usage: 94.5+ KB

In [19]:
num_col = [col for col in df.columns if df[col].dtype != 'object']
type(num_col)

list

In [22]:
cat_col = [col for col in df.columns if df[col].dtype == 'object']
cat_col

['state_name', 'county_name']

In [28]:
df[cat_col].nunique()

state_name      42
county_name    254
dtype: int64

### <b>Calculating percentages of missing values</b>

In [36]:
df.sum().iloc[0]

45878

In [37]:
round((df.isnull().sum()/df.shape[0])*100,2)`

state_code         0.0
state_name         0.0
county_code        0.0
county_name        0.0
aqi                0.0
state_code_int     0.0
county_code_int    0.0
dtype: float64

In [39]:
df.head()

,state_code,state_name,county_code,county_name,aqi,state_code_int,county_code_int
0,4,Arizona,13,Maricopa,18.0,4,13
1,4,Arizona,13,Maricopa,9.0,4,13
2,4,Arizona,19,Pima,20.0,4,19
3,6,California,1,Alameda,11.0,6,1
4,6,California,7,Butte,6.0,6,7

In [41]:
import matplotlib.pyplot as plt